[RM_APGrenade X2GrenadeTemplate]
FriendlyName="AP Grenade"
FriendlyNamePlural="AP Grenades"
BriefSummary="This anti-personnel grenade is tuned to kill via shrapnel compared to a standard grenade's concussive blast. Armor is effective against it, but in exchange it has a larger radius and deals more damage. Additionally, it deals conventional projectile damage rather than explosive, meaning that not only will they not destroy loot or corpses, but abilities that offer explosive resistance or immunity won't guard against them."
TacticalText="<Bullet/> AP Grenades are useful for inflicting high damage against groups of unarmored targets. Armored targets will take much less damage from them.\n<Bullet/> These grenades can be blocked by cover, and can't damage most terrain, but may still set off certain environmental explosives.\n<Bullet/> AP Grenades do not destroy corpses or loot when killing enemies, and abilities that offer explosive resistance or immunity won't guard against them.\n<Bullet/> Enemies that may be more vulnerable to explosive damage, such as the Chosen, won't take extra damage from AP Grenades."
ThrownAbilityName="Throw AP Grenade"
ThrownAbilityHelpText="Throw an AP Grenade at target area."
LaunchedAbilityname="Launch AP Grenade"
LaunchedAbilityHelpText="Launch an AP Grenade at target area."

[RM_APGrenade_MK2 X2GrenadeTemplate]
FriendlyName="Alloy Grenade"
FriendlyNamePlural="Alloy Grenades"
BriefSummary="An anti-personnel grenade augmented with scavenged alien alloys, and an Elerium-based detonator. The Alloy Grenade has a larger radius and deals more damage than the AP Grenade, and armor is slightly less effective against it. Like the AP Grenade, it deals conventional projectile damage rather than explosive, meaning that not only will Alloy Grenades not destroy loot or corpses, and abilities that offer explosive resistance or immunity won't guard against them."
TacticalText="<Bullet/> Alloy Grenades' improved shrapnel quality and velocity increases both damage and radius, while also making target armor slightly less of a problem.\n<Bullet/> These grenades can be blocked by cover, and can't damage most terrain, but may still set off certain environmental explosives.\n<Bullet/> Alloy Grenades do not destroy corpses or loot when killing enemies, and abilities that offer explosive resistance or immunity won't guard against them.\n<Bullet/> Enemies that may be more vulnerable to explosive damage, such as the Chosen, won't take extra damage from Alloy Grenades."
ThrownAbilityName="Throw Alloy Grenade"
ThrownAbilityHelpText="Throw an Alloy Grenade at target area."
LaunchedAbilityname="Launch Alloy Grenade"
LaunchedAbilityHelpText="Launch an Alloy Grenade at target area."